Revit 2027 API
MEPAnalyticalConnection.CanSupportAnalyticalConnection Method
 Checks if the connector can support the analytical connection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanSupportAnalyticalConnection(
	Connector connector
)
Public Shared Function CanSupportAnalyticalConnection (
	connector As Connector
) As Boolean
public:
static bool CanSupportAnalyticalConnection(
	Connector^ connector
)
static member CanSupportAnalyticalConnection :
        connector : Connector -> bool
Parameters
connector Connector
 The testing connector.
Return Value
Boolean
 True if the connector can support the network flow/pressure analysis, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPAnalyticalConnection Class
Autodesk.Revit.DB Namespace